Task : Write a NumPy program to check whether two arrays are equal (element wise) or not.

        array1 = np.array([0.5, 1.5, 0.2])
        
        array2 = np.array([0.4999999999, 1.500000000, 0.2])

In [1]:
import numpy as np
array1 = np.array([0.5, 1.5, 0.2])
array2 = np.array([0.4999999999, 1.500000000, 0.2])

In [5]:
print(np.equal(array1, array2))

[False  True  True]

Task : Create Pandas Series for below data: 

                USA	    3,10,33,801
                Brazil	1,25,77,354
                India	1,20,95,855
                France	45,54,683
                Russia	45,28,543
                UK	    43,37,696
                Italy	35,44,957
                Spain	32,70,825
                Turkey	32,40,577
                Germany	27,96,400

In [13]:
import pandas as pd
country=pd.array([31033801,12577354,12095855,4554683,4528543,4337696,3544957,3270825,3240577,2796400])
ser=pd.Series(country,index=['USA','Brazil','India','France','Russia','UK','Italy','Spain','Turkey','Germany'])
ser

USA        31033801
Brazil     12577354
India      12095855
France      4554683
Russia      4528543
UK          4337696
Italy       3544957
Spain       3270825
Turkey      3240577
Germany     2796400
dtype: Int64

In [14]:
ser[2:7]

India     12095855
France     4554683
Russia     4528543
UK         4337696
Italy      3544957
dtype: Int64

In [16]:
ser.loc['India']

12095855

In [17]:
Olympics={"Hostcity":['Gotham','Metropolis','Amazon'],"Year":[2021,2013,2017],"No.of Participants":[10000,20000,1000]}

In [19]:
Olympics_df=pd.DataFrame(Olympics)
Olympics_df

     Hostcity  Year  No.of Participants
0      Gotham  2021               10000
1  Metropolis  2013               20000
2      Amazon  2017                1000

In [20]:
Corona={'Country':['USA','Brazil','India','France','Russia','UK','Italy','Spain','Turkey','Germany'],'Total_Cases':[31033801,12577354,12095855,4554683,4528543,4337696,3544957,3270825,3240577,2796400],'Total_Deaths':[563206,314268,162147,94956,98033,126615,108350,75199,31230,76599]}

In [21]:
Corona_df=pd.DataFrame(Corona)
Corona_df

   Country  Total_Cases  Total_Deaths
0      USA     31033801        563206
1   Brazil     12577354        314268
2    India     12095855        162147
3   France      4554683         94956
4   Russia      4528543         98033
5       UK      4337696        126615
6    Italy      3544957        108350
7    Spain      3270825         75199
8   Turkey      3240577         31230
9  Germany      2796400         76599

In [22]:
Corona_df.Total_Cases.sum()

81980691

In [23]:
Corona_df.Total_Cases.mean()

8198069.1

In [24]:
Corona_df.Total_Deaths.mean()

165060.3

In [25]:
Corona_df.Total_Deaths.sum()

1650603

In [40]:
Corona_df[['Country','Total_Deaths']].min()

Country         Brazil
Total_Deaths     31230
dtype: object

In [41]:
Corona_df.describe()

        Total_Cases   Total_Deaths
count  1.000000e+01      10.000000
mean   8.198069e+06  165060.300000
std    8.801311e+06  159409.953182
min    2.796400e+06   31230.000000
25%    3.339358e+06   81188.250000
50%    4.433120e+06  103191.500000
75%    1.021056e+07  153264.000000
max    3.103380e+07  563206.000000

In [43]:
temperature={'Temperature':[68.9,66.4,68.7,71.4,69.3,68.5,66.5,67.2,68.7,68.9,65.7,65.6,67.1,66.8],'Wind_Speed':[6.9,5.8,9.2,9.2,9.2,9.2,6.9,4.7,3.4,6.9,4.7,6.9,9.2,9.2],'wind_direction':[215,153.33,102.5,106.67,76.67,70,64,80,100,60,73.33,96.67,110,130]}
temperature_df=pd.DataFrame(temperature)
temperature_df

    Temperature  Wind_Speed  wind_direction
0          68.9         6.9          215.00
1          66.4         5.8          153.33
2          68.7         9.2          102.50
3          71.4         9.2          106.67
4          69.3         9.2           76.67
5          68.5         9.2           70.00
6          66.5         6.9           64.00
7          67.2         4.7           80.00
8          68.7         3.4          100.00
9          68.9         6.9           60.00
10         65.7         4.7           73.33
11         65.6         6.9           96.67
12         67.1         9.2          110.00
13         66.8         9.2          130.00

In [45]:
persons={'state':['NY','TX','FL','AL','AK','TX','TX'],'color':['blue','green','red','white','gray','black','red'],'food':['steak','lamb','mango','apple','cheese','melon','beans'],'age':[30,2,12,4,32,33,69],'height':[165,70,120,80,180,172,150],'score':[4.6,8.3,9.0,3.3,1.8,9.5,2.2]}

In [55]:
persons_df=pd.DataFrame(persons)

In [54]:
persons_df.set_index([pd.Index(['Jane','Niko','Aaron','Penelope','Dean','Chriistina','Cornelia'])])

           state  color    food  age  height  score
Jane          NY   blue   steak   30     165    4.6
Niko          TX  green    lamb    2      70    8.3
Aaron         FL    red   mango   12     120    9.0
Penelope      AL  white   apple    4      80    3.3
Dean          AK   gray  cheese   32     180    1.8
Chriistina    TX  black   melon   33     172    9.5
Cornelia      TX    red   beans   69     150    2.2

In [56]:
Rank={'Rank':[1,2,3,4,5],'Language':['Python','Java','Javascript','C#','PHP'],'Share':[29.88,19.05,8.17,7.30,6.15],'Trend':[4.1,-1.8,0.1,-0.1,-1.0]}
Rank_df=pd.DataFrame(Rank)
Rank_df

   Rank    Language  Share  Trend
0     1      Python  29.88    4.1
1     2        Java  19.05   -1.8
2     3  Javascript   8.17    0.1
3     4          C#   7.30   -0.1
4     5         PHP   6.15   -1.0

In [57]:
persons_df.score.min()

1.8

In [58]:
persons_df.score.max()

9.5

In [59]:
Rank_df.Trend.mean()

0.25999999999999995

In [71]:
healthcare=pd.read_csv('healthcare_Data.csv')
healthcare

,Age,Gender,AppointmentRegistration,ApointmentData,DayOfTheWeek,Status,Diabetes,Alcoolism,HiperTension,Handcap,Smokes,Scholarship,Tuberculosis,Sms_Reminder,AwaitingTime
0,19.0,M,2014-12-16T14:46:25Z,2015-01-14T00:00:00Z,Wednesday,Show-Up,0,0,0.0,0,0,0,0,0,-29
1,24.0,F,2015-08-18T07:01:26Z,2015-08-19T00:00:00Z,Wednesday,Show-Up,0,0,0.0,0,0,0,0,0,-1
2,4.0,F,2014-02-17T12:53:46Z,2014-02-18T00:00:00Z,Tuesday,Show-Up,0,0,0.0,0,0,0,0,0,-1
3,5.0,M,2014-07-23T17:02:11Z,2014-08-07T00:00:00Z,Thursday,Show-Up,0,0,0.0,0,0,0,0,1,-15
4,38.0,M,2015-10-21T15:20:09Z,2015-10-27T00:00:00Z,Tuesday,Show-Up,0,0,0.0,0,0,0,0,1,-6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
299995,41.0,M,2014-03-24T09:28:22Z,2014-04-16T00:00:00Z,Wednesday,Show-Up,0,0,1.0,0,0,0,0,1,-23
299996,67.0,F,2014-11-21T12:00:36Z,2014-11-25T00:00:00Z,Tuesday,Show-Up,1,0,1.0,0,0,0,0,1,-4
299997,48.0,F,2014-07-24T15:46:38Z,2014-07-25T00:00:00Z,Friday,No-Show,0,0,0.0,0,0,1,0,0,-1
299998,5.0,M,2015-05-15T09:58:50Z,2015-05-21T00:00:00Z,Thursday,Show-Up,0,0,0.0,0,0,0,0,0,-6
299999,0.0,M,2015-06-12T14:34:25Z,2015-07-15T00:00:00Z,Wednesday,Show-Up,0,0,0.0,0,0,0,0,1,-33

In [73]:
modified_df=healthcare.fillna(healthcare.Age.mean())
modified_df.head(30000)

,Age,Gender,AppointmentRegistration,ApointmentData,DayOfTheWeek,Status,Diabetes,Alcoolism,HiperTension,Handcap,Smokes,Scholarship,Tuberculosis,Sms_Reminder,AwaitingTime
0,19.0,M,2014-12-16T14:46:25Z,2015-01-14T00:00:00Z,Wednesday,Show-Up,0,0,0.0,0,0,0,0,0,-29
1,24.0,F,2015-08-18T07:01:26Z,2015-08-19T00:00:00Z,Wednesday,Show-Up,0,0,0.0,0,0,0,0,0,-1
2,4.0,F,2014-02-17T12:53:46Z,2014-02-18T00:00:00Z,Tuesday,Show-Up,0,0,0.0,0,0,0,0,0,-1
3,5.0,M,2014-07-23T17:02:11Z,2014-08-07T00:00:00Z,Thursday,Show-Up,0,0,0.0,0,0,0,0,1,-15
4,38.0,M,2015-10-21T15:20:09Z,2015-10-27T00:00:00Z,Tuesday,Show-Up,0,0,0.0,0,0,0,0,1,-6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,64.0,F,2014-10-02T09:54:54Z,2014-10-29T00:00:00Z,Wednesday,No-Show,0,0,1.0,0,1,0,0,0,-27
29996,64.0,F,2015-06-11T10:20:56Z,2015-07-09T00:00:00Z,Thursday,Show-Up,0,0,1.0,0,0,0,0,1,-28
29997,4.0,M,2015-03-05T09:16:01Z,2015-03-12T00:00:00Z,Thursday,Show-Up,0,0,0.0,0,0,0,0,1,-7
29998,50.0,M,2014-04-10T07:20:57Z,2014-04-11T00:00:00Z,Friday,Show-Up,0,0,0.0,0,0,0,0,0,-1
29999,31.0,F,2014-02-26T13:34:33Z,2014-03-07T00:00:00Z,Friday,Show-Up,0,0,0.0,0,0,0,0,1,-9

Create DF for Below Data
        companyName : ["Google", "Google", "Microsoft", "FaceBook", "FaceBook"]
        Person : ["Sam", "Charlie", "Amy", "Vanessa", "Carl", "Sarah"]
        Sales : [200,120,340,124,243,350]

In [81]:
company={'companyName' : ["Google", "Google", "Microsoft","Microsoft" ,"FaceBook", "FaceBook"] ,'Person' : ["Sam", "Charlie", "Amy", "Vanessa", "Carl", "Sarah"], 'Sales' : [200,120,340,124,243,350]}
company

{'companyName': ['Google',
  'Google',
  'Microsoft',
  'Microsoft',
  'FaceBook',
  'FaceBook'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [82]:
company_df=pd.DataFrame(company)
company_df

  companyName   Person  Sales
0      Google      Sam    200
1      Google  Charlie    120
2   Microsoft      Amy    340
3   Microsoft  Vanessa    124
4    FaceBook     Carl    243
5    FaceBook    Sarah    350

Create DF for Below Data
           
            First Name : ["George", "Bill", "Ronald", "Jimmy", "George"]
            Last Name : ["Bush", "Clinton", "Regan", "cater", "washington"]
            
            Group By the DF based on First Name

In [83]:
fname={'First Name' : ["George", "Bill", "Ronald", "Jimmy", "George"]
        ,'Last Name' : ["Bush", "Clinton", "Regan", "cater", "washington"]}

In [85]:
fname

{'First Name': ['George', 'Bill', 'Ronald', 'Jimmy', 'George'],
 'Last Name': ['Bush', 'Clinton', 'Regan', 'cater', 'washington']}

In [86]:
fname_df=pd.DataFrame(fname)
fname_df

  First Name   Last Name
0     George        Bush
1       Bill     Clinton
2     Ronald       Regan
3      Jimmy       cater
4     George  washington

In [87]:
group=fname_df.groupby("First Name")

In [89]:
group.get_group("George")

    Last Name
0        Bush
4  washington

In [92]:
fname_df.count()

First Name    5
Last Name     5
dtype: int64

Home Work Task : Create Pandas series to input employee names and assign employee IDs to each employee, and also retrive first four employees from the pandas series using their ID's

In [93]:
employee=pd.array(['EmpA','EmpB','EmpC','EmpD','EmpE'])
employee_id=pd.Series(employee,index=[1,2,3,4,5])
employee_id

1    EmpA
2    EmpB
3    EmpC
4    EmpD
5    EmpE
dtype: string

In [94]:
employee[:3]

<StringArray>
['EmpA', 'EmpB', 'EmpC']
Length: 3, dtype: string